btcven/cortex-debug-cc26xx-cc13xx/data/cc2650f128.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AON_WUC</name>
      <baseAddress>0x40091000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>This component control the Wakeup controller residing in the AON domain.

Note: This module is only supporting 32 bit ReadWrite access from MCU</description>
      <registers>
        <register>
          <name>MCUCLK</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>MCU Clock Management

This register contains bitfields related to the MCU clock.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RCOSC_HF_CAL_DONE</name>
              <description>[2:2] MCU bootcode will set this bit when RCOSC_HF is calibrated.  The FLASH can not be used until this bit is set.

1: RCOSC_HF is calibrated to 48 MHz, allowing FLASH to power up.
0: RCOSC_HF is not yet calibrated, ie FLASH must not assume that the SCLK_HF is safe</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>PWR_DWN_SRC</name>
              <description>[1:0] Controls the clock source for the entire MCU domain while MCU is requesting powerdown.

When MCU requests powerdown with SCLK_HF as source, then WUC will switch over to this clock source during powerdown, and automatically switch back to SCLK_HF when MCU is no longer requesting powerdown and system is back in active mode.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCLK_LF</name>
                  <value>1</value>
                  <description>Use SCLK_LF in Powerdown</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>No clock in Powerdown</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AUXCLK</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>AUX Clock Management

This register contains bitfields that are relevant for setting up the clock to the AUX domain.</description>
          <fields>
            <field>
              <name>RESERVED13</name>
              <description>[31:13] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>19</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>PWR_DWN_SRC</name>
              <description>[12:11] When AUX requests powerdown with SCLK_HF as source, then WUC will switch over to this clock source during powerdown, and automatically switch back to SCLK_HF when AUX system is back in active mode</description>
              <bitWidth>2</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCLK_LF</name>
                  <value>1</value>
                  <description>Use SCLK_LF in Powerdown</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>No clock in Powerdown</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCLK_HF_DIV</name>
              <description>[10:8] Select the AUX clock divider for SCLK_HF

NB: It is not supported to change the AUX clock divider while SCLK_HF is active source for AUX</description>
              <bitWidth>3</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV256</name>
                  <value>7</value>
                  <description>Divide by 256</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <value>6</value>
                  <description>Divide by 128</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <value>5</value>
                  <description>Divide by 64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <value>4</value>
                  <description>Divide by 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <value>3</value>
                  <description>Divide by 16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <value>2</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <value>1</value>
                  <description>Divide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <value>0</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[7:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Selects the clock source for AUX:

NB: Switching the clock source is guaranteed to be glitchless</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCLK_LF</name>
                  <value>4</value>
                  <description>LF Clock (SCLK_LF)</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCLK_HF</name>
                  <value>1</value>
                  <description>HF Clock (SCLK_HF)</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>MCUCFG</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>MCU Configuration

