btcven/cortex-debug-cc26xx-cc13xx/data/cc2650f128.svd
00: RCOSC_HF derived (31.25kHz)
01: XOSC_HF derived (31.25kHz)
10: RCOSC_LF (32kHz)
11: XOSC_LF (32.768kHz)</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>SPARE4</name>
              <description>[4:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SCLK_LF_SRC_SEL</name>
              <description>[3:2] Source select for sclk_lf</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSCLF</name>
                  <value>3</value>
                  <description>Low frequency XOSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCLF</name>
                  <value>2</value>
                  <description>Low frequency RCOSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSCHFDLF</name>
                  <value>1</value>
                  <description>Low frequency clock derived from High Frequency XOSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCHFDLF</name>
                  <value>0</value>
                  <description>Low frequency clock derived from High Frequency RCOSC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCLK_MF_SRC_SEL</name>
              <description>[1:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XCOSCHFDMF</name>
                  <value>1</value>
                  <description>Medium frequency clock derived from high frequency XOSC.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSCHFDMF</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCLK_HF_SRC_SEL</name>
              <description>[0:0] Source select for sclk_hf.  XOSC option is supported for test and debug only and should be used when the XOSC_HF is running.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XOSC</name>
                  <value>1</value>
                  <description>High frequency XOSC clk</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCOSC</name>
                  <value>0</value>
                  <description>High frequency RCOSC clock</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CTL1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Control 1
This register contains OSC_DIG configuration</description>
          <fields>
            <field>
              <name>RESERVED23</name>
              <description>[31:23] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>RCOSCHFCTRIMFRACT</name>
              <description>[22:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RCOSCHFCTRIMFRACT_EN</name>
              <description>[17:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>SPARE2</name>
              <description>[16:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_FAST_START</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RADCEXTCFG</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>RADC External Configuration</description>
          <fields>
            <field>
              <name>HPM_IBIAS_WAIT_CNT</name>
              <description>[31:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT</name>
              <description>[21:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>IDAC_STEP</name>
              <description>[15:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RADC_DAC_TH</name>
              <description>[11:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RADC_MODE_IS_SAR</name>
              <description>[5:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[4:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AMPCOMPCTL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Amplitude Compensation Control</description>
          <fields>
            <field>
              <name>SPARE31</name>
              <description>[31:31] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>AMPCOMP_REQ_MODE</name>
              <description>[30:30] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>AMPCOMP_FSM_UPDATE_RATE</name>
              <description>[29:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>28</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>250KHZ</name>
                  <value>3</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500KHZ</name>
                  <value>2</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MHZ</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MHZ</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMPCOMP_SW_CTRL</name>
              <description>[27:27] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>AMPCOMP_SW_EN</name>
              <description>[26:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>RESERVED24</name>
              <description>[25:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>IBIAS_OFFSET</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>IBIAS_INIT</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT_FINAL</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CAP_STEP</name>
              <description>[7:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>IBIASCAP_HPTOLP_OL_CNT</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AMPCOMPTH1</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Amplitude Compensation Threshold 1
This register contains threshold values for amplitude compensation algorithm</description>
          <fields>
            <field>
              <name>SPARE24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>HPMRAMP3_LTH</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>SPARE16</name>
              <description>[17:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>HPMRAMP3_HTH</name>
              <description>[15:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>IBIASCAP_LPTOHP_OL_CNT</name>
              <description>[9:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>HPMRAMP1_TH</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AMPCOMPTH2</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Amplitude Compensation Threshold 2
This register contains threshold values for amplitude compensation algorithm.</description>
          <fields>
            <field>
              <name>LPMUPDATE_LTH</name>
              <description>[31:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>SPARE24</name>
              <description>[25:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>LPMUPDATE_HTH</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>SPARE16</name>
              <description>[17:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_LPM</name>
              <description>[15:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>SPARE8</name>
              <description>[9:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_HPM</name>
              <description>[7:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SPARE0</name>
              <description>[1:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ANABYPASSVAL1</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Analog Bypass Values 1</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_ROW_Q12</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_COLUMN_Q12</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ANABYPASSVAL2</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_IBIASTHERM</name>
              <description>[13:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ATESTCTL</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Analog Test Control</description>
          <fields>
            <field>
              <name>SPARE30</name>
              <description>[31:30] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>SCLK_LF_AUX_EN</name>
              <description>[29:29] Enable 32 kHz clock to AUX_COMPB.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[28:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCDOUBLERNANOAMPCTL</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>ADC Doubler Nanoamp Control</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>NANOAMP_BIAS_ENABLE</name>
              <description>[24:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>SPARE23</name>
              <description>[23:23] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[22:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ADC_SH_MODE_EN</name>
              <description>[5:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ADC_SH_VBUF_EN</name>
              <description>[4:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[3:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ADC_IREF_CTRL</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
