btcven/cortex-debug-cc26xx-cc13xx/data/cc2650f128.svd
When DMACTL.EN = 1 : 
   Event = UDMA0 Channel 7 done event     OR     AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW

When DMACTL.EN = 0 :
   Event = (NOT AUX_ANAIF:ADCFIFOSTAT.EMPTY)      OR      AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW  

Bit 7 in UDMA0:DONEMASK must be 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>MCU_EV</name>
              <description>[14:14] Event from EVENT configured by EVENT:AUXSEL0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>ACLK_REF</name>
              <description>[13:13] TDC reference clock.
It is configured by DDI_0_OSC:CTL0.ACLK_REF_SRC_SEL and enabled by AUX_WUC:REFCLKCTL.REQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>AUXIO15</name>
              <description>[12:12] AUXIO15 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>AUXIO14</name>
              <description>[11:11] AUXIO14 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>AUXIO13</name>
              <description>[10:10] AUXIO13 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>AUXIO12</name>
              <description>[9:9] AUXIO12 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AUXIO11</name>
              <description>[8:8] AUXIO11 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUXIO10</name>
              <description>[7:7] AUXIO10 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AUXIO9</name>
              <description>[6:6] AUXIO9   pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AUXIO8</name>
              <description>[5:5] AUXIO8   pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AUXIO7</name>
              <description>[4:4] AUXIO7   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AUXIO6</name>
              <description>[3:3] AUXIO6   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUXIO5</name>
              <description>[2:2] AUXIO5   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUXIO4</name>
              <description>[1:1] AUXIO4   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AUXIO3</name>
              <description>[0:0] AUXIO3   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVTOMCUPOL</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Event To MCU Polarity

Event source polarity configuration for EVTOMCUFLAGS.</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>ADC_IRQ</name>
              <description>[10:10] Select the event source level that sets EVTOMCUFLAGS.ADC_IRQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBSMUX0</name>
              <description>[9:9] Select the event source level that sets EVTOMCUFLAGS.OBSMUX0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_FIFO_ALMOST_FULL</name>
              <description>[8:8] Select the event source level that sets EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DONE</name>
              <description>[7:7] Select the event source level that sets EVTOMCUFLAGS.ADC_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPH_AUTOTAKE_DONE</name>
              <description>[6:6] Select the event source level that sets EVTOMCUFLAGS.SMPH_AUTOTAKE_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER1_EV</name>
              <description>[5:5] Select the event source level that sets EVTOMCUFLAGS.TIMER1_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER0_EV</name>
              <description>[4:4] Select the event source level that sets EVTOMCUFLAGS.TIMER0_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDC_DONE</name>
              <description>[3:3] Select the event source level that sets EVTOMCUFLAGS.TDC_DONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[2:2] Select the event source level that sets EVTOMCUFLAGS.AUX_COMPB.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[1:1] Select the event source level that sets EVTOMCUFLAGS.AUX_COMPA.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AON_WU_EV</name>
              <description>[0:0] Select the event source level that sets EVTOMCUFLAGS.AON_WU_EV.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>Low level</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>High level</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVTOMCUFLAGS</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Events to MCU Flags

This register contains a collection of event flags routed to MCU domain. 

