btcven/cortex-debug-cc26xx-cc13xx/data/cc2650f128.svd
Select source and polarity for TDC start and stop events. See the Technical Reference Manual for event timing requirements.</description>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>STOP_POL</name>
              <description>[13:13] Polarity of stop source.

Change only while STAT.STATE is IDLE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>TDC conversion stops when low level is detected.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>TDC conversion stops when high level is detected.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOP_SRC</name>
              <description>[12:8] Select stop source from the asynchronous AUX event bus.

Change only while STAT.STATE is IDLE.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TDC_PRE</name>
                  <value>31</value>
                  <description>Select TDC Prescaler event which is generated by configuration of PRECTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EV</name>
                  <value>30</value>
                  <description>AUX_EVCTL:EVSTAT1.MCU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <value>29</value>
                  <description>AUX_EVCTL:EVSTAT1.ACLK_REF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <value>28</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <value>27</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <value>26</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <value>25</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <value>24</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <value>23</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <value>22</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <value>21</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <value>20</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <value>19</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <value>18</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <value>17</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <value>16</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <value>15</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <value>14</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <value>13</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG_WU</name>
                  <value>12</value>
                  <description>AUX_EVCTL:EVSTAT0.AON_PROG_WU</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_SW</name>
                  <value>11</value>
                  <description>AUX_EVCTL:EVSTAT0.AON_SW</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX1</name>
                  <value>10</value>
                  <description>AUX_EVCTL:EVSTAT0.OBSMUX1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX0</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT0.OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_FIFO_ALMOST_FULL</name>
                  <value>8</value>
                  <description>AUX_EVCTL:EVSTAT0.ADC_FIFO_ALMOST_FULL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DONE</name>
                  <value>7</value>
                  <description>AUX_EVCTL:EVSTAT0.ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPH_AUTOTAKE_DONE</name>
                  <value>6</value>
                  <description>AUX_EVCTL:EVSTAT0.SMPH_AUTOTAKE_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1_EV</name>
                  <value>5</value>
                  <description>AUX_EVCTL:EVSTAT0.TIMER1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0_EV</name>
                  <value>4</value>
                  <description>AUX_EVCTL:EVSTAT0.TIMER0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISRC_RESET</name>
                  <value>3</value>
                  <description>AUX_ANAIF:ISRCCTL.RESET_N</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>2</value>
                  <description>AUX_EVCTL:EVSTAT0.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>1</value>
                  <description>AUX_EVCTL:EVSTAT0.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2</name>
                  <value>0</value>
                  <description>AUX_EVCTL:EVSTAT0.AON_RTC_CH2</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[7:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>START_POL</name>
              <description>[5:5] Polarity of start source.

Change only while STAT.STATE is IDLE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>1</value>
                  <description>TDC conversion starts when low level is detected.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>0</value>
                  <description>TDC conversion starts when high level is detected.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_SRC</name>
              <description>[4:0] Select start source from the asynchronous AUX event bus.

Change only while STAT.STATE is IDLE.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TDC_PRE</name>
                  <value>31</value>
                  <description>Select TDC Prescaler event which is generated by configuration of PRECTL.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EV</name>
                  <value>30</value>
                  <description>AUX_EVCTL:EVSTAT1.MCU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <value>29</value>
                  <description>AUX_EVCTL:EVSTAT1.ACLK_REF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <value>28</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <value>27</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <value>26</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <value>25</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <value>24</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <value>23</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <value>22</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <value>21</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <value>20</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <value>19</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <value>18</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <value>17</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <value>16</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <value>15</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <value>14</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <value>13</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_PROG_WU</name>
                  <value>12</value>
                  <description>AUX_EVCTL:EVSTAT0.AON_PROG_WU</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_SW</name>
                  <value>11</value>
                  <description>AUX_EVCTL:EVSTAT0.AON_SW</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX1</name>
                  <value>10</value>
                  <description>AUX_EVCTL:EVSTAT0.OBSMUX1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSMUX0</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT0.OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_FIFO_ALMOST_FULL</name>
                  <value>8</value>
                  <description>AUX_EVCTL:EVSTAT0.ADC_FIFO_ALMOST_FULL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DONE</name>
                  <value>7</value>
                  <description>AUX_EVCTL:EVSTAT0.ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPH_AUTOTAKE_DONE</name>
                  <value>6</value>
                  <description>AUX_EVCTL:EVSTAT0.SMPH_AUTOTAKE_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER1_EV</name>
                  <value>5</value>
                  <description>AUX_EVCTL:EVSTAT0.TIMER1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER0_EV</name>
                  <value>4</value>
                  <description>AUX_EVCTL:EVSTAT0.TIMER0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISRC_RESET</name>
                  <value>3</value>
                  <description>AUX_ANAIF:ISRCCTL.RESET_N</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>2</value>
                  <description>AUX_EVCTL:EVSTAT0.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>1</value>
                  <description>AUX_EVCTL:EVSTAT0.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2</name>
                  <value>0</value>
                  <description>AUX_EVCTL:EVSTAT0.AON_RTC_CH2</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TRIGCNT</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Trigger Counter

