btcven/cortex-debug-cc26xx-cc13xx/data/cc2650f128.svd
This bit must not be modified unless UPD_ACK matches the current value.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MCUBUSCTL</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>MCU Bus Control

Controls the connection between the AUX domain bus and the MCU domain bus.

The buses must be disconnected to allow power-down or power-off of the AUX domain.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DISCONNECT_REQ</name>
              <description>[0:0] Requests the AUX domain bus to be disconnected from the MCU domain bus. The request has no effect when AON_WUC:AUX_CTL.AUX_FORCE_ON is set.

The disconnection status can be monitored through MCUBUSSTAT. Note however that this register cannot be read by the system CPU while disconnected.

It is recommended that this bit is set and remains set after initial power-up, and that the system CPU uses AON_WUC:AUX_CTL.AUX_FORCE_ON to connect/disconnect the bus.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MCUBUSSTAT</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>MCU Bus Status

Indicates the connection state of the AUX domain and MCU domain buses.

Note that this register cannot be read from the MCU domain while disconnected, and is therefore only useful for the AUX_SCE.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>DISCONNECTED</name>
              <description>[1:1] Indicates whether the AUX domain and MCU domain buses are currently disconnected (1) or connected (0).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DISCONNECT_ACK</name>
              <description>[0:0] Acknowledges reception of the bus disconnection request, by matching the value of MCUBUSCTL.DISCONNECT_REQ. 

Note that if AON_WUC:AUXCTL.AUX_FORCE_ON = 1 a reconnect to the MCU domain bus will be made regardless of the state of MCUBUSCTL.DISCONNECT_REQ</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AONCTLSTAT</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>AON Domain Control Status

Status of AUX domain control from AON_WUC.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUX_FORCE_ON</name>
              <description>[1:1] Status of AON_WUC:AUX_CTL.AUX_FORCE_ON.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SCE_RUN_EN</name>
              <description>[0:0] Status of AON_WUC:AUX_CTL.SCE_RUN_EN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>AUXIOLATCH</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>AUX Input Output Latch

Controls latching of signals between AUX_AIODIO0/AUX_AIODIO1 and AON_IOC.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Opens (1) or closes (0) the AUX_AIODIO0/AUX_AIODIO1 signal latching.

At startup, set EN = TRANSP before configuring AUX_AIODIO0/AUX_AIODIO1 and subsequently selecting AUX mode in the AON_IOC.

When powering off the AUX domain (using PWROFFREQ.REQ), set EN = STATIC in advance preserve the current state (mode and output value) of the I/O pins.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSP</name>
                  <value>1</value>
                  <description>Latches are transparent ( open )</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATIC</name>
                  <value>0</value>
                  <description>Latches are static ( closed )</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MODCLKEN1</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Module Clock Enable 1

Clock enable for each module in the AUX domain, for use by the AUX_SCE. Settings take effect immediately.

The settings in this register are OR'ed with the corresponding settings in MODCLKEN0. This allows system CPU and AUX_SCE to request clocks independently.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUX_ADI4</name>
              <description>[7:7] Enables (1) or disables (0) clock for AUX_ADI4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>AUX_SCE has requested clock for AUX_ADI4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>AUX_SCE has not requested clock for AUX_ADI4</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_DDI0_OSC</name>
              <description>[6:6] Enables (1) or disables (0) clock for AUX_DDI0_OSC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>AUX_SCE has requested clock for AUX_DDI0_OSC</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>AUX_SCE has not requested clock for AUX_DDI0_OSC</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDC</name>
              <description>[5:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ANAIF</name>
              <description>[4:4] Enables (1) or disables (0) clock for AUX_ANAIF.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>AUX_SCE has requested clock for ANAIF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>AUX_SCE has not requested clock for ANAIF</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER</name>
              <description>[3:3] Enables (1) or disables (0) clock for AUX_TIMER.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>AUX_SCE has requested clock for TIMER</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>AUX_SCE has not requested clock for TIMER</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIODIO1</name>
              <description>[2:2] Enables (1) or disables (0) clock for AUX_AIODIO1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>AUX_SCE has requested clock for AIODIO1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>AUX_SCE has not requested clock for AIODIO1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIODIO0</name>
              <description>[1:1] Enables (1) or disables (0) clock for AUX_AIODIO0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>AUX_SCE has requested clock for AIODIO0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>AUX_SCE has not requested clock for AIODIO0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMPH</name>
              <description>[0:0] Enables (1) or disables (0) clock for AUX_SMPH.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>AUX_SCE has requested clock for SMPH</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>AUX_SCE has not requested clock for SMPH</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
