btcven/cortex-debug-cc26xx-cc13xx/data/cc2650f128.svd
        <register>
          <name>CCFG_PROT_31_0</name>
          <addressOffset>0xff0</addressOffset>
          <size>32</size>
          <description>Protect Sectors 0-31
Each bit write protects one 4KB flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect.</description>
          <fields>
            <field>
              <name>WRT_PROT_SEC_31</name>
              <description>[31:31] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_30</name>
              <description>[30:30] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_29</name>
              <description>[29:29] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_28</name>
              <description>[28:28] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_27</name>
              <description>[27:27] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_26</name>
              <description>[26:26] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_25</name>
              <description>[25:25] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_24</name>
              <description>[24:24] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_23</name>
              <description>[23:23] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_22</name>
              <description>[22:22] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_21</name>
              <description>[21:21] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_20</name>
              <description>[20:20] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_19</name>
              <description>[19:19] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_18</name>
              <description>[18:18] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_17</name>
              <description>[17:17] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_16</name>
              <description>[16:16] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_15</name>
              <description>[15:15] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_14</name>
              <description>[14:14] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_13</name>
              <description>[13:13] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_12</name>
              <description>[12:12] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_11</name>
              <description>[11:11] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_10</name>
              <description>[10:10] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_9</name>
              <description>[9:9] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_8</name>
              <description>[8:8] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_7</name>
              <description>[7:7] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_6</name>
              <description>[6:6] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_5</name>
              <description>[5:5] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_4</name>
              <description>[4:4] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_3</name>
              <description>[3:3] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_2</name>
              <description>[2:2] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_1</name>
              <description>[1:1] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_0</name>
              <description>[0:0] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CCFG_PROT_63_32</name>
          <addressOffset>0xff4</addressOffset>
          <size>32</size>
          <description>Protect Sectors 32-63
Each bit write protects one 4KB flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect. Not in use by CC26x0 and CC13x0.</description>
          <fields>
            <field>
              <name>WRT_PROT_SEC_63</name>
              <description>[31:31] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_62</name>
              <description>[30:30] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_61</name>
              <description>[29:29] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_60</name>
              <description>[28:28] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_59</name>
              <description>[27:27] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_58</name>
              <description>[26:26] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_57</name>
              <description>[25:25] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_56</name>
              <description>[24:24] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_55</name>
              <description>[23:23] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_54</name>
              <description>[22:22] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_53</name>
              <description>[21:21] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_52</name>
              <description>[20:20] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_51</name>
              <description>[19:19] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_50</name>
              <description>[18:18] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_49</name>
              <description>[17:17] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_48</name>
              <description>[16:16] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_47</name>
              <description>[15:15] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_46</name>
              <description>[14:14] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_45</name>
              <description>[13:13] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_44</name>
              <description>[12:12] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_43</name>
              <description>[11:11] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_42</name>
              <description>[10:10] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_41</name>
              <description>[9:9] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_40</name>
              <description>[8:8] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_39</name>
              <description>[7:7] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_38</name>
              <description>[6:6] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_37</name>
              <description>[5:5] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_36</name>
              <description>[4:4] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_35</name>
              <description>[3:3] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_34</name>
              <description>[2:2] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_33</name>
              <description>[1:1] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_32</name>
              <description>[0:0] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
        <register>
          <name>CCFG_PROT_95_64</name>
          <addressOffset>0xff8</addressOffset>
          <size>32</size>
          <description>Protect Sectors 64-95
Each bit write protects one flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect. Not in use by CC26x0 and CC13x0.</description>
          <fields>
            <field>
              <name>WRT_PROT_SEC_95</name>
              <description>[31:31] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_94</name>
              <description>[30:30] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_93</name>
              <description>[29:29] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_92</name>
              <description>[28:28] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_91</name>
              <description>[27:27] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_90</name>
              <description>[26:26] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_89</name>
              <description>[25:25] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_88</name>
              <description>[24:24] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_87</name>
              <description>[23:23] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_86</name>
              <description>[22:22] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_85</name>
              <description>[21:21] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_84</name>
              <description>[20:20] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_83</name>
              <description>[19:19] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_82</name>
              <description>[18:18] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_81</name>
              <description>[17:17] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_80</name>
              <description>[16:16] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_79</name>
              <description>[15:15] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_78</name>
              <description>[14:14] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_77</name>
              <description>[13:13] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_76</name>
              <description>[12:12] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_75</name>
              <description>[11:11] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_74</name>
              <description>[10:10] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_73</name>
              <description>[9:9] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_72</name>
              <description>[8:8] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_71</name>
              <description>[7:7] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_70</name>
              <description>[6:6] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_69</name>
              <description>[5:5] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_68</name>
              <description>[4:4] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_67</name>
              <description>[3:3] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_66</name>
              <description>[2:2] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_65</name>
              <description>[1:1] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>WRT_PROT_SEC_64</name>
              <description>[0:0] 0: Sector protected</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFFFF</resetValue>
        </register>
