btcven/cortex-debug-cc26xx-cc13xx/data/cc2650f128.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_FPB</name>
      <baseAddress>0xE0002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Cortex-M's Flash Patch and Breakpoint (FPB)</description>
      <registers>
        <register>
          <name>CTRL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Control
This register is used to enable the flash patch block.</description>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>NUM_CODE2</name>
              <description>[13:12] Number of full banks of code comparators, sixteen comparators per bank. Where less than sixteen code comparators are provided, the bank count is zero, and the number present indicated by NUM_CODE1. This read only field contains 3'b000 to indicate 0 banks for Cortex-M processor.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>NUM_LIT</name>
              <description>[11:8] Number of literal slots field.

0x0: No literal slots
0x2: Two literal slots</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>NUM_CODE1</name>
              <description>[7:4] Number of code slots field.

0x0: No code slots
0x2: Two code slots
0x6: Six code slots</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[3:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>KEY</name>
              <description>[1:1] Key field. In order to write to this register, this bit-field must be written to '1'. This bit always reads 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Flash patch unit enable bit

0x0: Flash patch unit disabled
0x1: Flash patch unit enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x260</resetValue>
        </register>
        <register>
          <name>REMAP</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Remap
This register provides the remap base address location where a matched addresses are remapped. The three most significant bits and the five least significant bits of the remap base address are hard-coded to 3'b001 and 5'b00000 respectively. The remap base address must be in system space and is it required to be 8-word aligned, with one word allocated to each of the eight FPB comparators.</description>
          <fields>
            <field>
              <name>RESERVED29</name>
              <description>[31:29] This field always reads 3'b001. Writing to this field is ignored.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>REMAP</name>
              <description>[28:5] Remap base address field.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[4:0] This field always reads 0. Writing to this field is ignored.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x20000000</resetValue>
        </register>
        <register>
          <name>COMP0</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Comparator 0</description>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>[31:30] This selects what happens when the COMP address is matched. Address remapping only takes place for the 0x0 setting.

0x0: Remap to remap address. See REMAP.REMAP
0x1: Set BKPT on lower halfword, upper is unaffected
0x2: Set BKPT on upper halfword, lower is unaffected
0x3: Set BKPT on both lower and upper halfwords.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RESERVED29</name>
              <description>[29:29] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>COMP</name>
              <description>[28:2] Comparison address.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[1:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Compare and remap enable comparator 0. CTRL.ENABLE must also be set to enable comparisons.

0x0: Compare and remap for comparator 0 disabled
0x1: Compare and remap for comparator 0 enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>COMP1</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Comparator 1</description>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>[31:30] This selects what happens when the COMP address is matched. Address remapping only takes place for the 0x0 setting.

