btcven/cortex-debug-cc26xx-cc13xx/data/cc2650f128.svd
1 CCP is driven High when the TBILR  register is reloaded after the timer reaches 0.

This bit is only valid in PWM mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCP_ON_TO</name>
                  <value>1</value>
                  <description>CCP output pin is set to 1 on time-out</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGACY</name>
                  <value>0</value>
                  <description>Legacy operation</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBMRSU</name>
              <description>[10:10] Timer B Match Register Update mode
 
This bit defines when the TBMATCHR and TBPR registers are updated

If the timer is disabled (CTL.TBEN is clear) when this bit is set, TBMATCHR and TBPR are updated when the timer is enabled.
If the timer is stalled (CTL.TBSTALL is set) when this bit is set, TBMATCHR and TBPR are updated according to the configuration of this bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOUPDATE</name>
                  <value>1</value>
                  <description>Update TBMATCHR and TBPR, if used, on the next time-out.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLEUPDATE</name>
                  <value>0</value>
                  <description>Update TBMATCHR and TBPR, if used, on the next cycle.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBPWMIE</name>
              <description>[9:9] GPTM Timer B PWM Interrupt Enable
This bit enables interrupts in PWM mode on rising, falling, or both edges of the CCP output, as defined by the CTL.TBEVENT
In addition, when this bit is set and a capture event occurs, Timer A
automatically generates triggers to the DMA if the trigger capability is enabled by setting the CTL.TBOTE bit and the DMAEV.CBEDMAEN bit respectively.

0 Capture event interrupt is disabled.
1 Capture event interrupt is enabled.
This bit is only valid in PWM mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Interrupt is enabled.  This bit is only valid in PWM mode.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Interrupt is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBILD</name>
              <description>[8:8] GPT Timer B PWM Interval Load Write</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOUPDATE</name>
                  <value>1</value>
                  <description>Update the TBR register with the value in the TBILR register on the next timeout. If the prescaler is used, update the TBPS register with the value in the TBPR register on the next timeout.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLEUPDATE</name>
                  <value>0</value>
                  <description>Update the TBR register with the value in the TBILR register on the next clock cycle. If the pre-scaler is used, update the TBPS register with the value in the TBPR register on the next clock cycle.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBSNAPS</name>
              <description>[7:7] GPT Timer B Snap-Shot Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>If Timer B is configured in the periodic mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Snap-shot mode is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBWOT</name>
              <description>[6:6] GPT Timer B Wait-On-Trigger</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAIT</name>
                  <value>1</value>
                  <description>If Timer B is enabled (CTL.TBEN is set), Timer B does not begin counting until it receives a trigger from the timer in the previous position in the daisy chain. This function is valid for one-shot, periodic, and PWM modes</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOWAIT</name>
                  <value>0</value>
                  <description>Timer B begins counting as soon as it is enabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBMIE</name>
              <description>[5:5] GPT Timer B Match Interrupt Enable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>An interrupt is generated when the match value in the TBMATCHR register is reached in the one-shot and periodic modes.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>The match interrupt is disabled for match events. Additionally, output triggers on match events are prevented.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBCDIR</name>
              <description>[4:4] GPT Timer B Count Direction</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UP</name>
                  <value>1</value>
                  <description>The timer counts up. When counting up, the timer starts from a value of 0x0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOWN</name>
                  <value>0</value>
                  <description>The timer counts down.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBAMS</name>
              <description>[3:3] GPT Timer B Alternate Mode 

Note: To enable PWM mode, you must also clear TBCM bit and configure TBMR field to 0x2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM</name>
                  <value>1</value>
                  <description>PWM mode is enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAP_COMP</name>
                  <value>0</value>
                  <description>Capture/Compare mode is enabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBCM</name>
              <description>[2:2] GPT Timer B Capture Mode</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDGTIME</name>
                  <value>1</value>
                  <description>Edge-Time mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDGCNT</name>
                  <value>0</value>
                  <description>Edge-Count mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBMR</name>
              <description>[1:0] GPT Timer B Mode

0x0 Reserved
0x1 One-Shot Timer mode
0x2 Periodic Timer mode
0x3 Capture mode
The Timer mode is based on the timer configuration defined by bits 2:0 in the CFG register</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <value>3</value>
                  <description>Capture mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIODIC</name>
                  <value>2</value>
                  <description>Periodic Timer mode</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONE_SHOT</name>
                  <value>1</value>
                  <description>One-Shot Timer mode</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CTL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Control</description>
          <fields>
            <field>
              <name>RESERVED15</name>
              <description>[31:15] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>TBPWML</name>
              <description>[14:14] GPT Timer B PWM Output Level

0: Output is unaffected. 
1: Output is inverted.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <value>1</value>
                  <description>Inverted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <value>0</value>
                  <description>Not inverted</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED12</name>
              <description>[13:12] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBEVENT</name>
              <description>[11:10] GPT Timer B Event Mode

The values in this register are defined as follows:
Value Description
0x0 Positive edge
0x1 Negative edge
0x2 Reserved
0x3 Both edges
Note: If PWM output inversion is enabled, edge detection interrupt
behavior is reversed. Thus, if a positive-edge interrupt trigger
has been set and the PWM inversion generates a postive
edge, no event-trigger interrupt asserts. Instead, the interrupt
is generated on the negative edge of the PWM signal.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>3</value>
                  <description>Both edges</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <value>1</value>
                  <description>Negative edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS</name>
                  <value>0</value>
                  <description>Positive edge</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBSTALL</name>
              <description>[9:9] GPT Timer B Stall Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Timer B freezes counting while the processor is halted by the debugger.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Timer B continues counting while the processor is halted by the debugger.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBEN</name>
              <description>[8:8] GPT Timer B Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Timer B is enabled and begins counting or the capture logic is enabled based on CFG register.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Timer B is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TAPWML</name>
              <description>[6:6] GPT Timer A PWM Output Level</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <value>1</value>
                  <description>Inverted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <value>0</value>
                  <description>Not inverted</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[5:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TAEVENT</name>
              <description>[3:2] GPT Timer A Event Mode

The values in this register are defined as follows:
Value Description
0x0 Positive edge
0x1 Negative edge
0x2 Reserved
0x3 Both edges
Note: If PWM output inversion is enabled, edge detection interrupt
behavior is reversed. Thus, if a positive-edge interrupt trigger
has been set and the PWM inversion generates a postive
edge, no event-trigger interrupt asserts. Instead, the interrupt
is generated on the negative edge of the PWM signal.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOTH</name>
                  <value>3</value>
                  <description>Both edges</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEG</name>
                  <value>1</value>
                  <description>Negative edge</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POS</name>
                  <value>0</value>
                  <description>Positive edge</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TASTALL</name>
              <description>[1:1] GPT Timer A Stall Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Timer A freezes counting while the processor is halted by the debugger.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Timer A continues counting while the processor is halted by the debugger.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAEN</name>
              <description>[0:0] GPT Timer A Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <value>1</value>
                  <description>Timer A is enabled and begins counting or the capture logic is enabled based on the CFG register.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Timer A is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
