btcven/cortex-debug-cc26xx-cc13xx/data/cc2650f128.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C0</name>
      <baseAddress>0x40002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>I2CMaster/Slave Serial Controler</description>
      <registers>
        <register>
          <name>SOAR</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Slave Own Address
This register consists of seven address bits that identify this I2C device on the I2C bus.</description>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>OAR</name>
              <description>[6:0] I2C slave own address
This field specifies bits a6 through a0 of the slave address.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SSTAT</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Slave Status 
Note: This register shares address with SCTL, meaning that this register functions as a control register when written, and a status register when read.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>FBR</name>
              <description>[2:2] First byte received

0: The first byte has not been received.
1: The first byte following the slave's own address has been received.

This bit is only valid when the RREQ bit is set and is automatically cleared when data has been read from the SDR register.
Note: This bit is not used for slave transmit operations.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TREQ</name>
              <description>[1:1] Transmit request

0: No outstanding transmit request.
1: The I2C controller has been addressed as a slave transmitter and is using clock stretching to delay the master until data has been written to the SDR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RREQ</name>
              <description>[0:0] Receive request

0: No outstanding receive data
1: The I2C controller has outstanding receive data from the I2C master and is using clock stretching to delay the master until data has been read from the SDR register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SCTL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Slave Control
Note: This register shares address with SSTAT, meaning that this register functions as a control register when written, and a status register when read.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved field.  Writing any other value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>DA</name>
              <description>[0:0] Device active

0: Disables the I2C slave operation
1: Enables the I2C slave operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SDR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Slave Data
This register contains the data to be transmitted when in the Slave Transmit state, and the data received when in the Slave Receive state.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[7:0] Data for transfer
This field contains the data for transfer during a slave receive or transmit operation.  When written the register data is used as transmit data.  When read, this register returns the last data received.
Data is stored until next update, either by a system write for transmit or by an external master for receive.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SIMR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Slave Interrupt Mask
This register controls whether a raw interrupt is promoted to a controller interrupt.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>STOPIM</name>
              <description>[2:2] Stop condition interrupt mask

