btcven/cortex-debug-cc26xx-cc13xx/data/cc2650f128.svd
For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2SCLKGS</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>I2S Clock Gate For Sleep Mode</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2SCLKGDS</name>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <description>I2S Clock Gate For Deep Sleep Mode</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[0:0] 0: Disable clock
1: Enable clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CPUCLKDIV</name>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RATIO</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV2</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PERBUSDMACLKDIV</name>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>SPARE</name>
              <description>[31:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2SBCLKSEL</name>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <description>I2S Clock Control</description>
          <fields>
            <field>
              <name>SPARE</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[0:0] BCLK source selector

0: Use external BCLK
1: Use internally generated clock

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>GPTCLKDIV</name>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <description>GPT Scalar</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RATIO</name>
              <description>[3:0] Scalar used for GPTs. The division rate will be constant and ungated for Run / Sleep / DeepSleep mode. 

For changes to take effect, CLKLOADCTL.LOAD needs to be written
Other values are not supported.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV256</name>
                  <value>8</value>
                  <description>Divide by 256</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <value>7</value>
                  <description>Divide by 128</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <value>6</value>
                  <description>Divide by 64</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <value>5</value>
                  <description>Divide by 32</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <value>4</value>
                  <description>Divide by 16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <value>3</value>
                  <description>Divide by 8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <value>2</value>
                  <description>Divide by 4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <value>1</value>
                  <description>Divide by 2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1</name>
                  <value>0</value>
                  <description>Divide by 1</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2SCLKCTL</name>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <description>I2S Clock Control</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SMPL_ON_POSEDGE</name>
              <description>[3:3] On the I2S serial interface, data and WCLK is sampled and clocked out on opposite edges of BCLK. 

0 - data and WCLK are sampled on the negative edge and clocked out on the positive edge. 
1 - data and WCLK are sampled on the positive edge and clocked out on the negative edge.

